public class Main {
    public static void main(String[] args) {
        int price = 10_000;
        int rinmile = 20;
        int bmile = price / rinmile;
        System.out.println(bmile + " бонусных миль");
        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}